{
    "url": "http://www.bbc.co.uk/news/uk-england-manchester-39868851",
    "title": "Simon Danczuk: Ex-Labour MP denies rape allegation",
    "content": "\n        \n            \n                \n                \n                \n                \n                \n                 Image copyright\n                 PA\n                \n            \n            \n            \n                Image caption\n                \n                    Mr Danczuk said the allegation was \"totally false\"\n                \n            \n            \n        Former Labour MP Simon Danczuk is being investigated over a rape allegation.A woman complained to police on Monday that she was sexually assaulted by a man in his 50s in Westminster last May.The Metropolitan Police said inquiries continue but no arrests have been made.Mr Danczuk, 50, who has yet to confirm whether he will seek re-election in Rochdale as an independent after being dropped by Labour over another matter, described the rape allegation as \"totally false\".The woman's allegations were first reported by The Sun and the Mail Online.\n    \n        \n            /**/\n            (function() {\n                if (window.bbcdotcom && bbcdotcom.adverts && bbcdotcom.adverts.slotAsync) {\n                    bbcdotcom.adverts.slotAsync('mpu', [1,2,3]);\n                }\n            })();\n            /**/\n        \n    \nMr Danczuk said: \"The Metropolitan Police have not been in touch with me about this.\"It is a totally false allegation and I look forward to the police clearing it up.\"Resigned from LabourHe added: \"I can't help but find the timing of these allegations deeply suspicious.\"There is only a day to go before candidates have to submit nomination papers and some people desperately want to stop me.\"A Scotland Yard spokesman said: \"On Monday, 8 May 2017, officers from Greater Manchester Police referred an allegation of rape to the Metropolitan Police.\"A woman has alleged that she was raped by a man in his 50s.\"The incident is alleged to have occurred in May 2016 at a location in Westminster.\"He also said:  \"No arrests have been made and enquires continue.\"Mr Danzcuk was suspended by the Parliamentary Labour Party in December 2015, pending an investigation into allegations concerning his conduct, but continued to serve as an independent MP.He resigned from the party on Monday after he was barred from standing for Labour in Rochdale, a seat he had held since winning it from the Liberal Democrats in 2010.\n    "
}
